---
kind: type
id: T:Autodesk.Revit.DB.ViewDisplayBackgroundType
source: html/e18503c2-b9bc-0c87-9e5d-0fb47644aaa9.htm
---
# Autodesk.Revit.DB.ViewDisplayBackgroundType

A collection of settings defining the type of the view background

## Syntax (C#)
```csharp
public enum ViewDisplayBackgroundType
```